import 'package:get/get.dart';

class MyLocale implements Translations {
  @override
  Map<String, Map<String, String>> get keys => {
        "ar": {
          /***************login****************/
          "1": "قم بتسجيل الدخول كعضو GEN-Z",
          "2": "أو كمؤسسة",
          "3": "الأيميل",
          "4": "كلمة المرور",
          "5": "سجل الدخول كمؤسسة",
          "6": "هل نسيت كلمة المرور؟",
          "7": "تسجيل الدخول",
          "8": "قم بإنشاء حساب GEN-Z الخاص بك",
          /****************home**********************/
          "9": "ابحث",
          "10": "#فقط_لك",
          "11": "#الأحداث_القادمة",
          "12": "شاهد الكل",
          /********************Filter***********************/
          "12": "فلترة الأحداث",
          "13": "تطوعي",
          "14": "تعليمي",
          "15": "تقني",
          "16": "رياضي",
          "17": "صحي",
          "18": "طبيعة",
          "19": "#آخر_الأخبار",
          /******************Events********************/
          "20": "الأحداث",
          "21": "مخصص لك",
          "22": "كل الأحداث",
          "23": "الشائع",
          /********************Profile************************/
          "24": "الحساب",
          "25": "الرئيسية",
          "26": "الوضع الليلي",
          "27": "فلترة الأحداث",
          "28": "الإعدادات",
          "29": "تسجيل الخروج",
          "30": "نقاط",
          "31": "الأحداث المضافة",
          "32": "حذف",
        },
        "en": {
          /***************login****************/
          "1": "Sign in with your GEN-Z Member",
          "2": " or Organization",
          "3": "Email",
          "4": "Password",
          "5": "Login as an Organization",
          "6": "Forgot Password?",
          "7": "Sign in",
          "8": "Create your GEN-Z Account",
          /*****************home*********************/
          "9": "Search",
          "10": "#SpecialForYou",
          "11": "#UpcomingEvents",
          "12": "See All",
          /*********************Filter**********************/
          "12": "Filter Events",
          "13": "Volunteer",
          "14": "Edu",
          "15": "Tech",
          "16": "Athlete",
          "17": "Healthy",
          "18": "Nature",
          "19": "#News",
          /*******************Events*******************/
          "20": "Events",
          "21": "For you",
          "22": "All Events",
          "23": "Popular",
          /********************Profile************************/
          "24": "Profile",
          "25": "Home",
          "26": "Dark Theme",
          "27": "Filter events",
          "28": "Settings",
          "29": "Log out",
          "30": "Points",
          "31": "Registered Events",
          "32": "Delete",
        }
      };
}
